// Напишите программу, которая задаёт 2 одномерных массива из N 
//элементов которые заполняются случайными значениями в диапазоне 
//от N до M, находит среднее арифметическое элементов этих 2 массивов и далее выводит на экран результат суммы средних арифметических

Console.Clear();

Console.WriteLine("Введите размер 1го массива:");
int size = Convert.ToInt32(Console.ReadLine());

Console.WriteLine("Введите минимальное возможное значение в первом массиве:");
int min1 = int.Parse(Console.ReadLine());
Console.WriteLine("Введите максимальное возможное значение в первом массиве:");
int max1 = int.Parse(Console.ReadLine());

Random random = new Random();

int[] arrayOne = new int[size];

for (int i = 0; i < arrayOne.Length; i++)
{
    arrayOne[i] = new Random().Next(min1, max1 + 1);
}

Console.WriteLine("Первый массив: [ " + String.Join(",", arrayOne) + " ]");



Console.WriteLine("Введите размер 2го массива:");
int size2 = Convert.ToInt32(Console.ReadLine());

Console.WriteLine("Введите минимальное возможное значение во втором массиве:");
int min2 = int.Parse(Console.ReadLine());
Console.WriteLine("Введите максимальное возможное значение во втором массиве:");
int max2 = int.Parse(Console.ReadLine());



int[] arrayTwo = new int[size2];

for (int i = 0; i < arrayTwo.Length; i++)
{
    arrayTwo[i] = new Random().Next(min2, max2 + 1);
}
Console.WriteLine("Второй массив: [ " + String.Join(",", arrayTwo) + " ]");


int sumArrayOne = 0;
for (int i = 0; i < arrayOne.Length; i++)
{
    sumArrayOne += arrayOne[i];
}

int averageArrayOne = sumArrayOne / arrayOne.Length;
Console.WriteLine($"Округлённое среднее арифметическое первого массива: {averageArrayOne}");


int sumArrayTwo = 0;
for (int i = 0; i < arrayTwo.Length; i++)
{
    sumArrayTwo += arrayTwo[i];
}
int averageArrayTwo = sumArrayTwo / arrayTwo.Length;
Console.WriteLine($"Округлённое среднее арифметическое второго массива: {averageArrayTwo}");

Console.Write($"Сумма средних арифметических: {averageArrayOne + averageArrayTwo}");